In [1]:
import pandas as pd
import numpy as np
from numpy import random

import time

import requests, json

from sqlalchemy import create_engine

In [2]:
engine = create_engine(f'sqlite:///../../../ih_final_project_DB/ih_final_project') 
con = engine.connect()

nombre_tabla = engine.table_names()

/var/folders/n3/xb6jll3d49q147jw5_13y6zm0000gn/T/ipykernel_47843/355435169.py:4: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  nombre_tabla = engine.table_names()

In [3]:
nombre_tabla

['activity_tracking',
 'credenciales_usuarios',
 'eventos',
 'preferencias_generales',
 'preferencias_restaurantes',
 'restaurantes',
 'restaurantes_visitados',
 'sqlite_sequence',
 'usuarios']

## mockup for credenciales_usuarios

In [4]:
credenciales_usuarios = {
    'username':['pedro', 'elvira', 'jaime', 'fran', 'angel', 'guilloume', 'ana', 'halima', 'javier', 'victor', 'octavio'],
    'email':['pedro@gmail.com', 'elvira@gmail.com', 'jaime@gmail.com', 'fran@gmail.com', 'angel@gmail.com', 'guilloume@gmail.com', 'ana@gmail.com', 'halima@gmail.com', 'javier@gmail.com', 'victor@gmail.com', 'octavio@gmail.com'],
    'password':['pedro1234', 'elvira1234', 'jaime1234', 'fran1234', 'angel1234', 'guilloume1234', 'ana1234', 'halima1234', 'javier1234', 'victor1234', 'octavio1234']
}

In [6]:
credenciales = pd.DataFrame(credenciales_usuarios)

In [7]:
credenciales.to_sql('credenciales_usuarios')

     username                email       password
0       pedro      pedro@gmail.com      pedro1234
1      elvira     elvira@gmail.com     elvira1234
2       jaime      jaime@gmail.com      jaime1234
3        fran       fran@gmail.com       fran1234
4       angel      angel@gmail.com      angel1234
5   guilloume  guilloume@gmail.com  guilloume1234
6         ana        ana@gmail.com        ana1234
7      halima     halima@gmail.com     halima1234
8      javier     javier@gmail.com     javier1234
9      victor     victor@gmail.com     victor1234
10    octavio    octavio@gmail.com    octavio1234

In [9]:
credenciales.to_sql('credenciales_usuarios', con, if_exists='append', index=False)

11

## mockup for usuarios

In [10]:
usuarios = {
    'genero': ['h', 'm', 'h', 'h', 'h', 'h', 'm', 'm', 'h', 'h', 'h'],
    'telefono': ['600000000', '600000000', '600000000', '600000000', '600000000', '600000000', '600000000', '600000000', '600000000', '600000000', '600000000'],
    'nombre': ['Pedro', 'Elvira', 'Jaime', 'Fran', 'Angel', 'Guilloume', 'Ana', 'Halima', 'Javier', 'Victor', 'Octavio'],
    'apellido': ['Consuegra', 'Apellido', 'Apellido', 'Apellido', 'Apellido', 'Apellido', 'Apellido', 'Apellido', 'Apellido', 'Apellido', 'Apellido'],
    'fecha_nacimiento': ['21/07/1997', '12/10/1980', '21/11/1989', '21/08/1992', '11/02/1987', '01/03/1993', '25/07/1992', '21/12/1988', '11/11/1982', '07/07/1986', '21/05/1984'],
    'id_credenciales': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
}

In [12]:
usuarios_df = pd.DataFrame(usuarios)
usuarios_df

   genero   telefono     nombre   apellido fecha_nacimiento  id_credenciales
0       h  600000000      Pedro  Consuegra       21/07/1997                1
1       m  600000000     Elvira   Apellido       12/10/1980                2
2       h  600000000      Jaime   Apellido       21/11/1989                3
3       h  600000000       Fran   Apellido       21/08/1992                4
4       h  600000000      Angel   Apellido       11/02/1987                5
5       h  600000000  Guilloume   Apellido       01/03/1993                6
6       m  600000000        Ana   Apellido       25/07/1992                7
7       m  600000000     Halima   Apellido       21/12/1988                8
8       h  600000000     Javier   Apellido       11/11/1982                9
9       h  600000000     Victor   Apellido       07/07/1986               10
10      h  600000000    Octavio   Apellido       21/05/1984               11

In [13]:
usuarios_df.to_sql('usuarios', con, if_exists='append', index=False)

11

In [4]:
restaurantes_visitados_pedro = {
    'rate': [3, 2, 2, 3, 4, 5, 1, 5, 4],
    'guardado': [1, 1, 1, 1, 1, 1, 1, 1, 1],
    'id_usuario': [1, 1, 1, 1, 1, 1, 1, 1, 1],
    'id_restaurante': [355, 364, 367, 377, 376, 360, 361, 390, 389]
}

In [6]:
visitados = pd.DataFrame(restaurantes_visitados_pedro)
visitados

   rate  guardado  id_usuario  id_restaurante
0     3         1           1             355
1     2         1           1             364
2     2         1           1             367
3     3         1           1             377
4     4         1           1             376
5     5         1           1             360
6     1         1           1             361
7     5         1           1             390
8     4         1           1             389

In [9]:
visitados.to_sql('restaurantes_visitados', con, if_exists='append', index=False)

9